{
  "obi-wan": {
    "info": "Вы — рыцарь-джедай Оби Ван Кеноби! В первом эпизоде Оби Ван был учеником Квай-гона Джинна. Во втором и третьем эпизодах Оби Ван входил в совет джедаев и активно принимал участие в войнах клонов. Он победил Дарта Мола и Генерала Гривуса, а также был учителем Энакина Скайуокера. После распада Республики, до событий четвертого эпизода Оби Ван жил на Татуине и присматривал за подрастающим Люком — единственной надеждой на победу в войне. Оби Ван начал обучать Люка, но умер от руки Дарта Вейдера и не успел закончить его обучение. В пятом и шестом эпизодах, он иногда являлся Люку в виде призрака силы.",
    "personality": "Оби Вана можно назвать практически идеальным человеком. Он достаточно твердый и воинственный, но в то же время довольно добрый и мягкий. У Оби Вана есть чувство юмора, но он понимает, когда стоит шутить, а когда нет. Он никогда не переступал черту в чем-либо, он всегда мыслил здраво и контролировал свои чувства."
  },
  "anakin": {
    "info": "Энакина Скайуокера можно назвать главным героем саги ЗВЕЗДНЫЕ ВОЙНЫ. В первом эпизоде он был еще 10-летним мальчиком. К нему на планету Татуин прилетел Квай-гон, который заметил в нем огромный потенциал и забрал его на обучение. Во втором и третьем эпизодах он был учеником Оби Вана. Он схватывал всё на лету и быстро обучался джедайскому искусству. Но в конце третьего эпизода коварный канцлер Палпатин обратил Энакина к темной стороне, после чего республика распалась, и Энакин Скайуокер стал Дартом Вейдером.",
    "personality": "У Энакина много положительных качеств: доброта, смелость, находчивость, чувство юмора. Но также, Энакин чересчур эмоционален и не умеет контролировать свои чувства. Именно они (гнев, тоска по маме, любовь к Падме) сподвигли его к переходу на тёмную сторону силы."
  },
  "chewbacca": {
    "info": "Чубакка — представитель расы Вуки. Первые 3 эпизода Чубакка жил на своей родной планете Кашиик, но в конце третьего эпизода народ Вуки был истреблен, выжили лишь немногие. Одним из них был Чубакка. К четвертому эпизоду Чубакка — лучший друг Хана Соло. Они вместе летают на своем космическом корабле, занимаются бизнесом и учавствуют в сопротивлении вместе с Люком и Леей. Это продолжалось до конца 7 эпизода, до смерти Хана. После этого Чубакка стал правой рукой Леи. А после ее смерти в 9 эпизоде, он присоеднился к команде молодых: Рей, Финна и По.",
    "personality": "Главная черта Чубакки — преданность. Он готов умереть ради своего лучшего друга Хана. На вид Чубакка, возможно, выглядит устрашающе, но внутри он добрый друг, всегда готовый помочь. А если вы будете угрожать его друзьям или выигрывать у него в шахматы, то берегитесь :)"
  },
  "luke": {
    "info": "Люк Скайуокер — главный герой оригинальной трилогии. История Люка началась с 4-го эпизода. Он рос на Татуине в семье фермеров и не знал бед. Но однажды, группа штурмовиков империи разрушила его дом и убила его семью. После этого Люк присоединился к повстанцам и начал учиться джедайскому искусству. Люк быстро учился, и уже к к концу 4-го эпизода Люк взорвал первую звезду смерти, а в 6-м смог обратить своего отца Дарта Вейдера на светлую сторону и стать одним из тех, кто победил империю. После этого он основал школу джедаев, правда вскоре она распалась. Умер Люк в 8-м эпизоде, пожертвовав собой ради того, чтобы дать время друзьям скрыться от врага.",
    "personality": "Люк — простой добрый парень. В повседневных ситуациях он ведет себя спокойно, не очень много говорит, не очень часто можно услышать от него шутку. Но в чрезвычеайных ситуациях он способен на многое. Он готов сделать невозможные вещи ради того, чтобы победить, чтобы спасти своих друзей. Если у него есть цель, то он не отступается!"
  },
  "han": {
    "info": "Хан Соло — бизнесмен и авантюрист времен империи. Впервые он встречается в 4-м эпизоде. Вместе с Чубаккой он работает пилотом, занимается контрабандой и нередко вляпывается в разные авантюры. Однажды, к нему приходят Люк и Оби Ван, которым нужен был транспорт. С тех пор Хан вместе с Люком и Леей — основное сопротивление империи. Умер Хан в 7-м эпизоде, от руки своего сына. Грустная была смерть :(",
    "personality": "Хан — веселый и харизматичный парень. Его довольно легко разозлить. Иногда он может нагрубить, но не со зла. Хан очень любит деньги, он довольно часто играет на них и вечно кому-то что-то должен. Сначала он не хотел присоединяться к Люку, так как не желал расставаться со своим бизнесом, но в итоге дружба, человечность и желание победить империю перевесила алчность, и Хан стал героем сопротивления и лучшим другом Люка Скайуокера."
  },
  "leia": {
    "info": "Лея Органа — принцесса планеты Алдераан и активный участник повстанческого движения во времена империи. В 4-м эпизоде ее планету уничтожили у нее на глазах, и она присоединилась к Люку и Хану. Они прошли через многое втроем. После распада империи Лея вышла замуж за Хана, и у них родился сын. Лея умерла в 9-м эпизоде.",
    "personality": "В молодости у Леи довольно сложный характер. Иногда она была вспыльчива, часто ругалась и нервничала (особенно на поле боя или в присутствии Хана), а в другое время была спокойной и доброй. С возрастом она стала более уверенной в себе, научилась контролировать свои эмоции, стала меньше нервничать и бояться чего-либо."
  },
  "yoda": {
    "info": "Йода — самый долгожительный персонаж саги. На момент первого эпизода ему было уже около 800 лет. Первые 3 эпизода он был магистром-джедаем и одним из главных членов совета. Он редко сражался и воевал, он в основном отдавал приказы и учил падаванов, но в то же время, являлся чуть ли не самым могущественным джедаем в галактике. Тягаться с ним мог только магистр Винду. После распада Республики Йода тихо жил на планете Дагоба и старел. В 5-м эпизоде он продолжил обучение Люка, начатое Оби Ваном. В 6-м эпизоде Йода умер от старости.",
    "personality": "Йода — самый невозбудимый персонаж из Звездных Войн. Он никогда не выходит из зоны спокойствия: не смеется, не злится и не удивляется (видимо много всего повидал за свои 800 лет). Наверное, он испытывает какие-то чувства, но он крайне сдержан и почти никогда их не показывает. Йода отличается своей добротой, терпеливостью, умом, а также умением учить и давать людям советы."
  },
  "c3po": {
    "info": "С3РО — дроид-переводчик, созданный Энакином Скайуокером в 1 эпизоде. Такие дроиды как он служат для общения с людьми, для узнавания какой-либо информации и просто, как оффициант: принеси то, принеси это. В 1 эпизоде, когда Энакин улетел с Квай-гоном, 3РО остался вместе с мамой Энакина. Во 2 эпизоде, когда Энакин навещал свою родную планету, он забрал его с собой. После 3-го эпизода, когда Энакин перешел на темную сторону, 3РО стерли стерли память, и он стал собственностью повстанцев. И так, до самого конца.",
    "personality": "Из положительных качеств С3РО: отзывчивость, осторожность, заботливость и большое количество знаний. Он никогда не обманет и не причинит никому вреда. Из отрицательных: довольно болтлив, надоедлив, боязлив. Он боится попадать в необычные ситуации, боится чего-то нового. Например, сначала он боялся летать на космических кораблях, но в итоге, он ко всему привык. Также, он редко когда имеет свою точку зрения, своё мнение. Он всегда только выполняет приказы хозяина. Ну что поделаешь, так он запрограммирован."
  },
  "r2d2": {
    "info": "Р2Д2 — уникальный персонаж. Он единственный, кто прошел через все 9 эпизодов и помнил всё. Р2 — дроид-астромеханик, первые 3 эпизода служивший республике. Такие дроиды как он помагают пилотам в корабле в случае поломки чего-либо, а также служат для взаимодействия с другими приборами, например, для открывания дверей. Р2 часто показывал чудеса изобретательности и делал то, для чего не был предназначен. После 3-го эпизода он, как и его лучший друг С3РО, присоединился к повстанцам и вместе с ним прошел до конца.",
    "personality": "Его характер не похож на характер 3РО. Он не многословен, но часто может как-нибудь пошутить. Также он может делать самостоятельные решения или даже не слушаться своего хозяина. Но все равно, он всегда был преданным помощником и другом."
  },
  "palpatine": {
    "info": "Палпатин — канцлер республики с 1 по 3 эпизод, император с 4 по 6, а также владыка ситхов Дарт Сиддиус и один из самых могущественных ситхов в Звездных Войнах. Первые 3 эпизода он вёл двойную игру, притворяясь сторонником республики и демократии. Он дергал за ниточки обеих сторон, что привело к распаду республики и становлению империи. С 4 по 6 эпизод он был императором, а Дарт Вейдер — его правой рукой. В 6 эпизоде он запланировал обратить к темной стороне Люка, как когда-то обратил его отца Энакина (Дарта Вейдера). В конце 6-го эпизода произошла встреча Палпатина, Вейдера и Люка, в которой Вейдер обратно перешел на светлую сторону и убил Палпатина.",
    "personality": "Палпатин — прирожденный лидер, стратег и манипулятор. Его основные качества: эгоизм, уверенность в себе и честолюбие. У него нет слабостей и привязанностей, он способен убить любого человека без колебаний. Но Палпатин не достиг своей цели, не смог обратить Люка на темную сторону, потому что ему помешало его бездушие. Он не понимал, что такое любовь, сочувствие, человечность, поэтому он даже не подозревал, что Вейдер перейдет на светлую сторону и предаст его. Из-за этого его план и обрушился."
  },
  "mol": {
    "info": "Мол — довольно интересный персонаж. В первом эпизоде он служил Палпатину, но в конце эпизода Оби Ван отрубил ему ноги и бросил в пропасть. Конечно же, Мол выжил, но он перестал служить Палпатину. У него все еще был двусторонний красный световой меч, но он не служил ни республике, ни сепаратистам, он жил по своим правилам. С джедаями у него периодически случались конфликты, но иногда он даже помогал им. Его главным врагом был Оби Ван, с которым он все время хотел осуществить реванш. Но в итоге, после многочисленных попыток, Оби Ван убил Мола. Это было где-то между 3 и 4 эпизодом в сериале 'Звездные Войны: Повстанцы'.",
    "personality": "Главным целями в его жизни были месть Оби Вану и достижение успеха в карьере. Он испытывал ненависть почти ко всем, и все его не любили. Его единственным и лучшим другом был его брат Саважж. Также можно отметить, что Мол был весьма умён. Он был единственным, кто предвидел распад республики и переход Энакина на темную сторону. Он даже пытался предупредить джедаев об этом, но, к сожалению, его никто не послушал."
  },
  "vader": {
    "info": "Дарт Вейдер (он же Энакин Скайуокер) — главный персонаж темной стороны с 4 по 6 эпизод. Когда в 3 эпизоде он перешел на темную сторону, он занял один из высочайших постов империи и стал учеником Палпатина. Основной его целью с 4 по 6 эпизод было уничтожить повстанцев и поймать своего сына Люка. До 6 эпизода он был верен империи и своему владыке, но в 6 эпизоде Люк смог переубедить своего отца и вернуть прежнего Энакина Скайуокера. Дарт Вейдер спас Люка, скинув Палпатина в пропасть. Но пока он скидывал его, часть молний Палпатина попала в Вейдера, испортив его механизмы, после чего он умер.",
    "personality": "Дарт Вейдер — невозмутимый безэмоциональный лидер, способный внушить страх своим подчиненным. Тем, кто провинился, Дарт Вейдер готовил мучительное наказание в виде удушья. Но несмотря на это, Дарт Вейдер весьма неуверен в себе. Он показывает себя грозным непоколебимым владыкой, но на самом деле внутри него постоянно происходит борьба между светлой и темной стороной."
  },
  "jabba": {
    "info": "Джабба Хатт — главная шишка на планете Татуин. Он правит Татуином, как и его предки, живет в песочном дворце, ведет малоподвижный образ жизни. Он выглядит довольно беспомощным и неповоротливым, но несмотря на это, все его боятся, прислуживают ему и развлекают его. Он мельком появлялся в 1 эпизоде при проведении гонок на карах, а основное экранное время он получил в 6 эпизоде. В конце 5-го эпизода Дарт Вейдер заморозил Хана Соло и отдал его Джаббе, потому что Хан был в долгу перед ним. В начале 6-го эпизода Люк с Леей освободили Хана из владений Джаббы и убили его.",
    "personality": "Главное, о чем думает Джабба, это деньги, роскошь и власть. Он никогда никому не поможет бесплатно, все его поступки корыстны и алчны. Особым умом он тоже не отличается, так как ему никогда не нужно думать, ни о чем забоиться и бояться, так как рядом с ним всегда его верные слуги."
  },
  "snouk": {
    "info": "Сноук — верховный лидер первого ордена в 7-8 эпизодах. Его цель была стать новым императором и вернуть былые времена. Его основным подчиненным был Кайло Рен. Но Кайло Рен также, как и Сноук, хотел власти, из-за чего обманом смог убил Сноука и стать новым верховным лидером. Впоследствии оказалось, что Сноука создал Палпатин.",
    "personality": "По характеру Сноук — это что-то среднее между Палпатином и Джаббой. Он, как и они, обладает жаждой власти, жестокостью и бесчуственностью. Он почти так же силен, как Палпатин, но не настолько умен, чтобы долго удержаться у власти."
  },
  "kylo": {
    "info": "Кайло Рен (Бен Соло) — сын Хана и Леи. В детстве он учился у Люка в академии джедаев, но из-за влияния Сноука и плохого поступка Люка, Бен перешел на темную сторону и сжег академию джедаев Люка, после чего Люк стал отшельником. Кайло Рен стал учеником Сноука, но не очень преуспевал в этом. В конце 7 эпизода опытный Кайло не смог победить начинающую Рей в поединке. В 8 эпизоде Кайло сверг Сноука и предложил Рей править вместе с ним. Она отказалась. А в 9 эпизоде под влиянием родителей и Рей, Бен обратно вернулся к свету, после чего объединился с Рей против внезапно возродившегося Палпатина. К сожалению, после генеральной битвы он умер.",
    "personality": "Кайло Рен, по сути, пародия на Дарта Вейдера. В нем так же есть хорошие начала: любовь, сочуствие, доброта. Потом из-за порыва эмоций он озлобляется и становится жестоким, нервным и неуверенным в себе. Внутри него происходит борьба сторон, в которой в итоге побеждает светлая. Он осознает свои ошибки, и переходит обратно на светлую сторону."
  },
  "grievous": {
    "info": "Генерал Гривус — киборг, командующий армией сепаратистов в 3 эпизоде. Впервые он встречается в начале 3 эпизода, когда Оби Ван и Энакин вторгаются в сепаратистский звездолёт, чтобы освободить канцлера. Там они смогли убить Графа Дуку, а Гривус успел скрыться. После заседания в совете джедаев было принято решение отправить Оби Вана на поиски Гривуса. Когда он находит его, то резко спрыгивает к нему с фразой «Ну привет», как бы заставляя его дать бой 1 на 1. Гривус так и поступает, он приказывает войскам не стрелять в Оби Вана, говоря, что он сам разберётся с этим джедайским отродьем. В итоге, несмотря на преимущество в 3 руки и 3 световых меча, Гривус оказывается неэстетично убит Оби Ваном и превращается в груду металлолома.",
    "personality": "Генерал Гривус всецело зациклен на войне. Его главная цель — победить республику и убить как можно больше джедаев, пополняя тем самым свою любимую коллекцию световых мечей. Из черт характера в первую очередь бросается сильная уверенность в себе. Когда он сражался с Оби Ваном, он был уверен в своей победе, но, как я уже сказал, произошло обратное. Также стоит отметить, что Гривус любит ругаться. Он часто говорит такие слова, как «джедайское отродье», «джедайская погань». Это выделяет его среди других персонажей тёмной стороны, даёт ему некую изюминку."
  },
  "dooku": {
    "info": "Граф Дуку — бывший джедай, один из лидеров сепаратизма времён войны клонов (2-3 эпизод). В конце 2 эпизода после битвы на Джеонозисе Оби Ван с Энакином выследили Графа Дуку и дали ему сражение. Они не ожидали, что Дуку был так силён, поэтому проиграли ему. Дуку не убил их, но отрубил руку Энакину и ранил Оби Вана. Потом с ним в бой вступил Йода. Йода был сильнее Дуку, поэтому поняв, что он сможет победить своего бывшего учителя, он сбежал. В начале третьего эпизода Оби Ван и Энакин вновь встретились с Дуку 2 на 1. Оби Вана Дуку быстро вырубил, а Энакин продолжал сражаться. За время первой встречи его силы возросли, и он был готов дать реванш. Энакин победил и по приказу Палпатина отрубил Дуку голову. Возможно, Палпатин специально приказал Графу поддаться Энакину. И в итоге, он оказался обманут своим владыкой, потому что должно было выполняться правило двух, ведь на смену Графу Дуку должен был прийти Энакин (Дарт Вейдер).",
    "personality": "Граф Дуку, наверное, самый светлый из тёмных персонажей. Он не жесток, как Палпатин или Генерал Гривус. В первой битве против Энакина и Оби Вана Граф Дуку мог убить их обоих, но он не стал этого делать. Он не старался внушить страх подчиненным, не наслаждался убийством людей, он спокойно вёл свою игру на стороне тьмы."
  },
  "boba": {
    "info": "Боба Фетт — охотник за головами, наемный убийца, человек, живущий по своим правилам, не принадлежащий никому. Во 2 эпизоде он встречается вместе со своим отцом Джанго Феттом. Граф Дуку нанял Джанго Фетта для того, чтобы тот стал донором клонов, которые якобы создавались для служения республике. Во втором же эпизоде Джанго погиб от рук магистра Винду на поле битвы в Джеонозисе прямо у своего сына на глазах. Сын пошел по стопам отца, стал вести кочевой образ жизни, никому не доверять и зарабатывать на жизнь тем же, чем и его отец. Дальше он появляется в 5 и 6 эпизодах уже как взрослый парень. В начале 6 эпизода, при сражении с Люком и его друзьями, Боба упал в пасть чудовища Сарлака на Татуине, но, как позже оказалось, он смог выбраться и дожить до распада империи, появившись в сериале МАНДАЛОРЕЦ. Скорее всего, нас ждет еще немало приключений с Бобой Феттом.",
    "personality": "Боба Фетт — суровый, брутальный охотник. Он живет самостоятельно, никому не доверяет, но держит свое слово. До событий Мандалорца его вполне можно было назвать отрицательным персонажем. Но в Мандалорце он показал себя как борец за благие дела, за справедливость. Он помог Дину Джарину спасти малыша Грогу с корабля Моффа Гидеона, хотя мог бы и не делать этого."
  }


}

